export const questions = [
  {
    id: 1,
    text: "動機付けの特徴「主体性」でわかることは…",
    options: ["クライアントにやる気があるか", "商品やサービスに関して、どの品質レベルを目指しているのか", "コーチングするにあたり、私たちが積極的にクライアントを先導するのか、またはクライアントが自ら率先して動くのか"],
    correctAnswer: 2,
    correctAnswerExplanation:"反映・分析型のクライアントの場合は先導する必要があるが、主体・行動型のクライアントの場合は、彼らの旅路に同伴するような形にすると良い",
    multipleChoice: false,
  },
  {
    id: 2,
    text: "主体・行動型モードのクライアントの特徴は、特定の状況において…",
    options: ["自ら主体的になる", "私たちの指示を待つ", "物事をコントロールしたがる", "他者が追いつくのを待ちたくない"],
    correctAnswer: [0,2,3],
    correctAnswerExplanation: "この人は、常に先を急ごうとしている。すぐに始めて、すぐに結果を出したがる。",
    multipleChoice: true,
  },
 //其他的問題  
];




