export const questions = [{
    id: 1,
    text: "詳細型トリガーが発動している人の特徴は…",
    options: ["幅広い、詳細な情報を必要とする", "詳細が多すぎると飽きる", "リストに従って仕事をすることを好む", "理想としては、情報が順次提示されることを好む"],
    correctAnswer: [0, 2, 3],
    correctAnswerExplanation: "彼らが必要としている詳細を与えましょう。また、正確に体系化して伝えましょう。",
    multipleChoice: true,
  },
  {
    id: 2,
    text: "全体型のトリガーが発動している人の特徴は…",
    options: ["イメージ（視覚的な映像）で話すことが多い", "プロジェクトを正確かつ完璧に説明できる", "詳細にすぐに圧倒され、イライラし、飽きる", "構造化されたリストを必要とする", "大まかな概要しか伝えない傾向がある"],
    correctAnswer: [0, 2, 4],
    correctAnswerExplanation: "詳しく説明したいという誘惑に負けてはいけない。相手の関心を失い、さらに退屈で目がどんよりするのが見えてしまうかもしれない！",
    multipleChoice: true,
  },
 //其他的問題
];